In [1]:
#import store dataset
import pandas as pd
import os
store_df = pd.read_csv(r'D:\DS_DataSpark Illuminating Insights for Global Electronics\raw_datasets\Stores.csv')

In [2]:
store_df.head() #show first 5 rows

   StoreKey    Country                         State  Square Meters  Open Date
0         1  Australia  Australian Capital Territory          595.0   1/1/2008
1         2  Australia            Northern Territory          665.0  1/12/2008
2         3  Australia               South Australia         2000.0   1/7/2012
3         4  Australia                      Tasmania         2000.0   1/1/2010
4         5  Australia                      Victoria         2000.0  12/9/2015

In [3]:
store_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 67 entries, 0 to 66
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   StoreKey       67 non-null     int64
 1   Country        67 non-null     object
 2   State          67 non-null     object
 3   Square Meters  66 non-null     float64
 4   Open Date      67 non-null     object
dtypes: float64(1), int64(1), object(3)
memory usage: 2.7+ KB

Open Date column has wrong datatype instead of datetime it has object so, altering it

In [4]:
store_df['Open Date'] = pd.to_datetime(store_df['Open Date'],format='%m/%d/%Y')

In [5]:
store_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 67 entries, 0 to 66
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   StoreKey       67 non-null     int64
 1   Country        67 non-null     object
 2   State          67 non-null     object
 3   Square Meters  66 non-null     float64
 4   Open Date      67 non-null     datetime64[ns]
dtypes: datetime64[ns](1), float64(1), int64(1), object(2)
memory usage: 2.7+ KB

Check Null Values and eliminate it

In [6]:
store_df.isna().sum()

StoreKey         0
Country          0
State            0
Square Meters    1
Open Date        0
dtype: int64

In [7]:
store_df.describe()

        StoreKey  Square Meters                      Open Date
count  67.000000      66.000000                             67
mean   33.000000    1402.196970  2011-06-24 00:42:59.104477696
min     0.000000     245.000000            2005-03-04 00:00:00
25%    16.500000    1108.750000            2009-06-03 00:00:00
50%    33.000000    1347.500000            2010-06-03 00:00:00
75%    49.500000    2000.000000            2013-06-07 00:00:00
max    66.000000    2105.000000            2019-03-05 00:00:00
std    19.485037     576.404058                            NaN

In [8]:
store_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 67 entries, 0 to 66
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   StoreKey       67 non-null     int64
 1   Country        67 non-null     object
 2   State          67 non-null     object
 3   Square Meters  66 non-null     float64
 4   Open Date      67 non-null     datetime64[ns]
dtypes: datetime64[ns](1), float64(1), int64(1), object(2)
memory usage: 2.7+ KB

Check Duplicates

In [9]:
store_df.duplicated().sum()

np.int64(0)

Standardize Text Columns

In [10]:
store_df['Country'] = store_df['Country'].str.strip().str.lower()
store_df['State'] = store_df['State'].str.strip().str.lower()

In [11]:
store_df.head()

   StoreKey    Country                         State  Square Meters  Open Date
0         1  australia  australian capital territory          595.0 2008-01-01
1         2  australia            northern territory          665.0 2008-01-12
2         3  australia               south australia         2000.0 2012-01-07
3         4  australia                      tasmania         2000.0 2010-01-01
4         5  australia                      victoria         2000.0 2015-12-09

Check for Invalid Values (check if any unwanted text or format)

In [12]:
store_df['Country'].unique()

array(['australia', 'canada', 'france', 'germany', 'italy', 'netherlands',
       'united kingdom', 'united states', 'online'], dtype=object)

In [13]:
store_df['State'].unique()

array(['australian capital territory', 'northern territory',
       'south australia', 'tasmania', 'victoria', 'western australia',
       'new brunswick', 'newfoundland and labrador',
       'northwest territories', 'nunavut', 'yukon', 'basse-normandie',
       'corse', 'franche-comté', 'la réunion', 'limousin', 'martinique',
       'mayotte', 'berlin', 'brandenburg', 'freie hansestadt bremen',
       'freistaat thüringen', 'hamburg', 'hessen',
       'mecklenburg-vorpommern', 'saarland', 'sachsen-anhalt',
       'caltanissetta', 'enna', 'pesaro', 'drenthe', 'flevoland',
       'friesland', 'groningen', 'zeeland', 'armagh', 'ayrshire',
       'belfast', 'blaenau gwent', 'dungannon and south tyrone',
       'fermanagh', 'north down', 'alaska', 'arkansas', 'connecticut',
       'delaware', 'hawaii', 'idaho', 'iowa', 'kansas', 'maine',
       'mississippi', 'montana', 'nebraska', 'nevada', 'new hampshire',
       'new mexico', 'north dakota', 'oregon', 'rhode island',
       'south carolina', 'south dakota', 'utah', 'washington dc',
       'west virginia', 'wyoming', 'online'], dtype=object)

Rename columns

In [14]:
store_df.columns

Index(['StoreKey', 'Country', 'State', 'Square Meters', 'Open Date'], dtype='object')

In [15]:
store_df = store_df.rename(columns={
    'StoreKey': 'store_key',
    'Country': 'country',
    'State': 'state',
    'Square Meters': 'square_meters',
    'Open Date': 'open_date'
})

Export Cleaned Data

In [16]:
store_df.to_csv('cleaned_dataset/stores.csv',index=False)

check dataframe

In [17]:
store_df

,store_key,country,state,square_meters,open_date
0,1,australia,australian capital territory,595.0,2008-01-01
1,2,australia,northern territory,665.0,2008-01-12
2,3,australia,south australia,2000.0,2012-01-07
3,4,australia,tasmania,2000.0,2010-01-01
4,5,australia,victoria,2000.0,2015-12-09
...,...,...,...,...,...
62,63,united states,utah,2000.0,2008-03-06
63,64,united states,washington dc,1330.0,2010-01-01
64,65,united states,west virginia,1785.0,2012-01-01
65,66,united states,wyoming,840.0,2014-01-01
66,0,online,online,NaN,2010-01-01